import csv

data = [("Филовский камень","282", "164", "371"),
("Тайная комната", "315", "157", "164"),
("Узник Азкабана", "647", "159", "235"),
("Кубок огня","855","580","360"),
("Орден Феникса","1365","632","446"),
("Принц-полукровка","715","1036","226"),
("Дары смерти","1312","584","173"),
]

with open('fil10.csv', 'w') as fp:
    writer = csv.writer(fp, delimiter = ',')
    writer.writerow(["Названия книг","Гермиона,Гермиону,Гермионе,Гермионой,Гермионы,Гермионовой,Гермионин,Гермионину,Гермиониных,Гермионина,Гермионистым,Гермионски", "Дамблдор,Думбльдор,Думбльдора,Думбльдоре,Думбльдором,Думбльдорова,Думбльдоров,Думбльдоровом,Дамблдора,Дамблдором,Дамблдоре,Дамблдоров,Дамблдоровский,Дамблдору,Дамблдоровых,Дамблдоры,Дамблдорова,Дамблдоров", "Хагрид,Огрид,Огрида,Огриду,Огридом,Огриде,Огридовских,Огридовские,Огридовых,Огридову,Огридовыми,Хагрида,Хагриде,Хагридов,Хагриду,Хагридова,Хагридом"])
    writer.writerows(data)

with open('fil10.csv', 'r') as fp:
    reader = csv.reader(fp, delimiter = ',', quotechar = '"')
    data_read = [row for row in reader]
